<a href="https://colab.research.google.com/github/KodumuruRaja/Feature-Engineering/blob/main/Feature-Engineering-(Analysis%20of%20Missing-Values%20(MCAR%2C%20MNAR)).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
data=pd.read_csv("/content/titanic.csv")

In [ ]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
#Missing data counted in sum
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
#missing data as per percentage
data.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

#Missing data not at random **MNAR**

In [ ]:
#more missing for dead people
#less missing for people alive

In [ ]:
data['cabin_null']=np.where(data['Cabin'].isnull(),1,0)
data.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  cabin_null
0            1         0       3  ...   NaN        S           1
1            2         1       1  ...   C85        C           0
2            3         1       3  ...   NaN        S           1
3            4         1       1  ...  C123        S           0
4            5         0       3  ...   NaN        S           1

[5 rows x 13 columns]

In [ ]:
data.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [ ]:
#age column
data['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [ ]:
data['Age'].isnull().groupby(data['Survived']).mean()

Survived
0    0.227687
1    0.152047
Name: Age, dtype: float64

#Missing Data Completely at Random **MCAR**

In [ ]:
data['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [ ]:
data['Embarked'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Embarked, Length: 891, dtype: bool

In [ ]:
data[data['Embarked'].isnull()]

     PassengerId  Survived  Pclass  ... Cabin Embarked  cabin_null
61            62         1       1  ...   B28      NaN           0
829          830         1       1  ...   B28      NaN           0

[2 rows x 13 columns]